service/src/main/resources/xml/catalogStoredQueries.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--

    Copyright (C) 2013 52°North Initiative for Geospatial Open Source
    Software GmbH

    This program is free software; you can redistribute it and/or modify it
    under the terms of the GNU General Public License version 2 as published
    by the Free Software Foundation.

    If the program is linked with libraries which are licensed under one of
    the following licenses, the combination of the program with the linked
    library is not considered a "derivative work" of the program:

        - Apache License, version 2.0
        - Apache Software License, version 1.0
        - GNU Lesser General Public License, version 3
        - Mozilla Public License, versions 1.0, 1.1 and 2.0
        - Common Development and Distribution License (CDDL), version 1.0

    Therefore the distribution of the program linked with libraries licensed
    under the aforementioned licenses, is permitted by the copyright holders
    if the distribution is compliant with both the GNU General Public
    License version 2 and the aforementioned licenses.

    This program is distributed in the hope that it will be useful, but
    WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
    Public License for more details.

-->
<!DOCTYPE soapenv>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:csw="http://www.opengis.net/cat/csw/2.0.2"
	xmlns:ogc="http://www.opengis.net/ogc" xmlns:gml="http://www.opengis.net/gml">
	<soapenv:Header />
	<soapenv:Body>
		<csw:Transaction service="CSW" version="2.0.2"
			verboseResponse="false" requestId="1">
			<csw:Insert>
				<rim:RegistryObjectList>

					<!-- stored queries as of OGC 07-144r4 -->
					<rim:AdhocQuery id="urn:ogc:def:ebRIM-Query:OGC:showStoredQueries">
						<rim:QueryExpression queryLanguage="urn:ogc:def:ebRIM-QueryLanguage:CSW-Filter">
<![CDATA[
<csw:Query typeNames="rim:AdhocQuery" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:csw="http://www.opengis.net/cat/csw/2.0.2" xmlns:ogc="http://www.opengis.net/ogc">
	<csw:ElementSetName typeNames="rim:AdhocQuery">full</csw:ElementSetName>   
	<csw:Constraint version="1.1.0">
		<ogc:Filter>
        	<ogc:PropertyIsLike wildCard="%">
            	<ogc:PropertyName>/rim:AdhocQuery/@id</ogc:PropertyName>
				<ogc:Literal>%</ogc:Literal>
			</ogc:PropertyIsLike>
		</ogc:Filter>
	</csw:Constraint>
	<ogc:SortBy/>
</csw:Query>
]]>
						</rim:QueryExpression>
					</rim:AdhocQuery>
					
					<!-- stored query as of OGC 09-163r1 -->

				</rim:RegistryObjectList>
			</csw:Insert>
		</csw:Transaction>
	</soapenv:Body>
</soapenv:Envelope>