src/layman/common/micka/soap-insert-template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Header xmlns:hs="http://www.hsrs.cz/micka">
    <hs:Public>{public}</hs:Public>
    <hs:Edit>{edit_user}</hs:Edit>
    <hs:Read>{read_user}</hs:Read>
</soap:Header>
<soap:Body>
<csw:Transaction xmlns:csw="http://www.opengis.net/cat/csw/2.0.2" version="2.0.2" service="CSW">
  <csw:Insert>
{record}
  </csw:Insert>
</csw:Transaction>
</soap:Body>
</soap:Envelope>
